title: Prefetch - Suspicious Runexehelper.exe Execution
description: Detects suspicious execution of Runexehelper.exe based on prefetch data.
  Launcher process.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: RUNEXEHELPER.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1218
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
