title: Prefetch - Suspicious Setres.exe Execution
description: Detects suspicious execution of Setres.exe based on prefetch data. Configures
  display settings.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: SETRES.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1218
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
