title: Prefetch - Suspicious rdrleakdiag.exe Execution
description: Detects suspicious execution of rdrleakdiag.exe based on prefetch data.
  Microsoft Windows resource leak diagnostic tool.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: RDRLEAKDIAG.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1003
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
