title: Prefetch - Suspicious Sc.exe Execution
description: Detects suspicious execution of Sc.exe based on prefetch data. Used by
  Windows to manage services.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: SC.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1564.004
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
