title: Prefetch - Suspicious Devinit.exe Execution
description: Detects suspicious execution of Devinit.exe based on prefetch data. Visual
  Studio 2019 tool.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: DEVINIT.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1218.007
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
