title: Prefetch - Suspicious At.exe Execution
description: Detects suspicious execution of At.exe based on prefetch data. Schedule
  periodic tasks.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: AT.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1053.002
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
