title: Prefetch - Suspicious IMEWDBLD.exe Execution
description: Detects suspicious execution of IMEWDBLD.exe based on prefetch data.
  Microsoft IME Open Extended Dictionary Module.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: IMEWDBLD.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1105
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
