title: Prefetch - Suspicious Shdocvw.dll Execution
description: Detects suspicious execution of Shdocvw.dll based on prefetch data. Shell
  Doc Object and Control Library..
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: SHDOCVW.DLL
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1218.011
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
