title: Prefetch - Suspicious Schtasks.exe Execution
description: Detects suspicious execution of Schtasks.exe based on prefetch data.
  Schedule periodic tasks.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: SCHTASKS.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1053.005
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
