title: Prefetch - Suspicious Pcwrun.exe Execution
description: Detects suspicious execution of Pcwrun.exe based on prefetch data. Program
  Compatibility Wizard.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: PCWRUN.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1218
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
