title: Prefetch - Suspicious Rasautou.exe Execution
description: Detects suspicious execution of Rasautou.exe based on prefetch data.
  Windows Remote Access Dialer.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: RASAUTOU.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1218
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
