title: Prefetch - Suspicious MpCmdRun.exe Execution
description: Detects suspicious execution of MpCmdRun.exe based on prefetch data.
  Binary part of Windows Defender. Used to manage settings in Windows Defender.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: MPCMDRUN.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1105
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
