title: Prefetch - Suspicious WorkFolders.exe Execution
description: Detects suspicious execution of WorkFolders.exe based on prefetch data.
  Work Folders.
status: experimental
logsource:
  product: velociraptor
  category: execution
  service: prefetch
detection:
  selection:
    Executable: WORKFOLDERS.EXE
  condition: selection
level: medium
tags:
- attack.lolbas
- attack.t1218
references:
- https://lolbas-project.github.io/
author: ilo
date: 2025/03/12
